src/cf/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЗначенияСвойствОбъектов/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)

	Если ЭтотОбъект.Отбор.Количество() > 0 Тогда
		НоменклатураСссылка = ЭтотОбъект.Отбор.Объект.Значение; 
		Если ТипЗнч(НоменклатураСссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			Для Каждого ТекСвойство Из ЭтотОбъект Цикл
				ОбщегоНазначения5LB.ЗаписатьИзменениеРегистраСведенийСОбъектом(НоменклатураСссылка,
					ТекСвойство.Свойство.Наименование, ТекСвойство.Значение);
			КонецЦикла;
		КонецЕсли; 		
	КонецЕсли;

	
КонецПроцедуры



Процедура ПриЗаписи(Отказ, Замещение)
	
	бПродолжить = Ложь;
	Если ЭтотОбъект.Количество() > 0 Тогда	
		НоменклатураСссылка = ЭтотОбъект.Отбор.Объект.Значение;	
		Если ЗначениеЗаполнено(НоменклатураСссылка) Тогда	
			Если ТипЗнч(НоменклатураСссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
				Если НЕ НоменклатураСссылка.ЭтоГруппа Тогда	
					стрИзменение = "";
					Для Каждого ТекСв Из ЭтотОбъект Цикл
						СвНазвание = "*" + ТекСв.Свойство.Наименование;
						стрИзменениеСв = ОбщегоНазначения5LB.ПолучитьИзмененияОбъектаСтрокой(НоменклатураСссылка, Ложь, СвНазвание);				
						Если стрИзменениеСв <> "" Тогда
							стрИзменение = стрИзменение + стрИзменениеСв + Символы.ПС;
							бПродолжить = Истина;
						КонецЕсли;	
						Если стрИзменение <> "" Тогда
							стрИзменение = Лев(стрИзменение, СтрДлина(стрИзменение) - 1);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;		
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;   	
	
					
	Если бПродолжить Тогда
		
		ОбрСоотв = Обработки._5LB_СоответствиеНоменклатуры_УТ11;     								
		бЕстьОбмен = ОбрСоотв.НоменклатураДоступнаДляОбмена(НоменклатураСссылка);	
		Если бЕстьОбмен Тогда
		 	НоменклатураХарактеристика = ОбрСоотв.НайтиСоответствиеНоменклатуры(НоменклатураСссылка); 
			НоменклатураУТ11 = НоменклатураХарактеристика.Номенклатура;
			ХарактеристикаУТ11 = НоменклатураХарактеристика.Характеристика;	
			Если ЗначениеЗаполнено(НоменклатураУТ11) Тогда	
				
				//стрИзменение = "";
				стрИзменение = Формат(ТекущаяДата(), "ДФ='dd.MM.yy HH:mm'") 
					+ " Изм.доп.рекв.(свед.) | "; 
				РезОбновления = ОбрСоотв.ОбновитьНоменклатуруСРеквизитами(
						НоменклатураСссылка, НоменклатураУТ11, ХарактеристикаУТ11, Истина,
						стрИзменение);
						//			
						//Если Источник.Метаданные().Имя = "ШтрихКод" Тогда  	// для штрих-кода отдельно
						//	ОбрСоотв.СинхронизироватьШтрихКод(НоменклатураСсылка, НоменклатураУТ11, ХарактеристикаУТ11);	
						//				////		бУспешно = НЕ ОбрСоотв.ОбновитьЗаписьСоответствий(Ссылка, НоваяНоменклатура, НоваяХарактеристика);  
						//				////	Если бУспешно Тогда
						//				////		стрСообщ = "Не удалось создать запись связи номенклатуры УТ-10 и новой номенклатуры УТ-11!";
						//				////		статусСообщ = СтатусСообщения.Важное;
						//				////		//Сообщить(стрСообщ, статусСообщ);												
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;				

КонецПроцедуры
